# Основы pandas

In [2]:
import pandas as pd

Пример забора данных с сайтов

In [4]:
pd.read_html('http://www.cbr.ru')[0]

  Курсы валют с 05.06.2020 с 06.06.2020
0  Доллар США     69,0151₽     68,6319₽
1        Евро     77,3245₽     77,9658₽

In [5]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [6]:
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  04.06.20    691371    685742    695510   684455
 1  03.06.20    685745    687170    689338   681995
 2  02.06.20    687155    691451    691725   685840
 3  01.06.20    691375    701995    703202   689895
 4  31.05.20    703485    702620    705680   702620
 5  29.05.20    702000    705259    708550   700580
 6  28.05.20    705385    708795    712363   701380
 7  27.05.20    708805    708098    714810   707260
 8  26.05.20    708112    715717    716716   706055,
        Имя  Unnamed: 1      %    курс                 Дата
 0  EUR/RUB         NaN -13732   77316  05.06.2020 18:08:00
 1  USD/RUB         NaN -11862   68317  05.06.2020 18:08:00
 2  CHF/RUB         NaN -19431  709882  05.06.2020 18:09:00
 3  JPY/RUB         NaN -16706     623  05.06.2020 18:09:00
 4  GBP/RUB         NaN  -2935  868019  05.06.2020 18:09:00
 5  NOK/RUB         NaN  -3408   73616  05.06.2020 18:09:00
 6  AUD/RUB         NaN  -6186  476844  05.06.2020 18:09:00
 7  NZD/RUB         NaN  -4497   44448  05.06.2020 18:09:00
 8  TRY/RUB         NaN -16318    1007  05.06.2020 18:09:00]

Импорт данных из файла

In [7]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [8]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [9]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
# если надо указать свои заголовки и разделитель
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [10]:
# количество строк в датафрейме

len(data)

1189482

In [11]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [12]:
data['year_plus_one'] = data['year'] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [14]:
dt_trans = pd.read_csv('transactions.csv')
dt_trans.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [17]:
len(dt_trans)

60

In [18]:
dt_trans.shape

(60, 8)

### Основные сведения о датафрейме

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   country        1189482 non-null  object
 1   year           1189482 non-null  int64
 2   quantity       1189482 non-null  float64
 3   category       1189482 non-null  int64
 4   year_plus_one  1189482 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [20]:
# немного статистики

data.describe()

               year      quantity      category  year_plus_one
count  1.189482e+06  1.189482e+06  1.189482e+06   1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01   2.003852e+03
std    7.167345e+00  1.585663e+07  1.809968e+01   7.167345e+00
min    1.990000e+03 -8.643480e+05  1.000000e+00   1.991000e+03
25%    1.997000e+03  1.400000e+01  2.400000e+01   1.998000e+03
50%    2.003000e+03  1.890000e+02  3.500000e+01   2.004000e+03
75%    2.009000e+03  2.265000e+03  5.100000e+01   2.010000e+03
max    2.014000e+03  6.680329e+09  7.100000e+01   2.015000e+03

### Отдельный столбец (тип Series)

In [21]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [22]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [23]:
type(data['year'])

pandas.core.series.Series

In [24]:
data.head()

   country  year  quantity  category  year_plus_one
0  Austria  1996       5.0         1           1997
1  Austria  1995      17.0         1           1996
2  Belgium  2014       0.0         1           2015
3  Belgium  2013       0.0         1           2014
4  Belgium  2012      35.0         1           2013

In [25]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [26]:
len(data['category'].unique())

71

In [27]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [28]:
# распределение количества строк по значениям столбца

data['category'].value_counts().head(10)

67    133916
27     97645
24     75132
42     64161
37     62156
39     53198
25     52032
21     50229
51     43466
31     42307
Name: category, dtype: int64

In [29]:
data['category'].value_counts(normalize=True).head()

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [34]:
dt_trans = pd.read_csv('transactions.csv')
dt_trans

    Year  Month    ID Product  Amount  Price  Total  Cost
0   2017      1  t001      A1       7   2904  20328  1200
1   2017      1  t002      A2       2   1896   3792  1100
2   2017      2  t003      A1       5   2904  14520  1200
3   2017      2  t004      A4       1   8618   8618  4200
4   2017      2  t005      A5       3   5175  15525   500
5   2017      2  t006      _6       4   3500  14000   200
6   2017      3  t007      _3       6   1265   7590   200
7   2017      3  t008      _5       2   5175  10350  1200
8   2017      4  t009      _8       3   3760  11280  1000
9   2017      4  t010      _4       2   8618  17236  3400
10  2017      4  t011      _2       4   1896   7584   800
11  2017      4  t012      _5       5   5175  25875   700
12  2017      4  t013      _8       3   3760  11280  1200
13  2017      4  t014      _4       1   8618   8618   250
14  2017      5  t015      _2       2   1896   3792   650
15  2017      5  t016      A4       3   8618  25854  2400
16  2017      5  t017      A5       2   5175  10350  1200
17  2017      5  t018      _6       4   3500  14000  1200
18  2017      5  t019      _3       5   1265   6325   200
19  2017      5  t020      _5       6   5175  31050   800
20  2017      5  t021      _3       7   1265   8855   700
21  2017      5  t022      _5       4   5175  20700  4200
22  2017      6  t023      _8      10   3760  37600   200
23  2017      6  t024      _4       3   8618  25854  1200
24  2017      6  t025      _2       1   1896   1896   250
25  2017      6  t026      _5       2   5175  10350   650
26  2017      6  t027      _8       3   3760  11280   800
27  2017      7  t028      _4       2   8618  17236   700
28  2017      7  t029      _2       4   1896   7584  1200
29  2017      7  t030      A4       1   8618   8618   250
30  2017      7  t031      _2       6   1896  11376   650
31  2017      7  t032      A4       2   8618  17236  2400
32  2017      8  t033      A5       2   5175  10350  1200
33  2017      8  t034      _3       2   1265   2530  1000
34  2017      8  t035      _5       1   5175   5175   800
35  2017      9  t036      _3       3   1265   3795  2400
36  2017      9  t037      _5       1   5175   5175   200
37  2017      9  t038      _8       1   3760   3760   700
38  2017      9  t039      _4       2   8618  17236  2400
39  2017      9  t040      _2       8   1896  15168  1000
40  2017      9  t041      _5       5   5175  25875   800
41  2017     10  t042      _8       3   3760  11280   800
42  2017     10  t043      _4       2   8618  17236   200
43  2017     10  t044      _5       6   5175  31050   700
44  2017     10  t045      _3       3   1265   3795   250
45  2017     11  t046      _5       5   5175  25875   650
46  2017     11  t047      A5       6   5175  31050  2400
47  2017     11  t048      A1       2   2904   5808  1200
48  2017     11  t049      A2       2   1896   3792  1200
49  2017     11  t050      A1       5   2904  14520   200
50  2017     11  t051      A4       3   8618  25854   800
51  2017     11  t052      A5       7   5175  36225   700
52  2017     11  t053      _2       5   1896   9480   250
53  2017     12  t054      A1       9   2904  26136   650
54  2017     12  t055      _8       2   3760   7520  2400
55  2017     12  t056      _4       2   8618  17236  1200
56  2017     12  t057      _2       8   1896  15168  1200
57  2017     12  t058      _5       2   5175  10350   200
58  2017     12  t059      _8       3   3760  11280   800
59  2017     12  t060      _3       4   1265   5060   700

In [33]:
dt_trans['Product'].value_counts().head()

_5    11
_2     8
_8     8
_4     7
_3     7
Name: Product, dtype: int64

In [37]:
dt_trans.Product.value_counts().head()

_5    11
_2     8
_8     8
_4     7
_3     7
Name: Product, dtype: int64

# Фильтры

In [38]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [39]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [40]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [41]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [42]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [43]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [44]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [45]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [46]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [ ]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

In [ ]:
filtered_countries['country'].unique()

In [ ]:
# фильтры на номер строки

data.loc[1000:1005]

# Сортировка

In [ ]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

In [ ]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

In [ ]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

### Параметр inplace

In [47]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [48]:
data.sort_values('country', ascending=True, inplace=rewrite)

NameError: name 'rewrite' is not defined

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [50]:
dt = pd.read_csv('transactions.csv')

In [57]:
dt.head()
dt[dt.Product == '_8'].sort_values('Cost',ascending = False).ID.head(1)

54    t055
Name: ID, dtype: object